#+TITLE: Methods in Constructing the CN Stellate Microcircuit
#+AUTHOR: Michael A Eager
#+DATE:
#+OPTIONS: toc:nil H:5 author:nil <:t >:t 
#+STARTUP: oddeven hideblocks fold align hidestars
#+TODO: REFTEX
#+LANGUAGE: en_GB

#+LATEX_HEADER:\graphicspath{{../SimpleResponsesChapter/gfx/}{../figures/}{/media/data/Work/cnstellate/}{/media/data/Work/cnstellate/ResponsesNoComp/ModulationTransferFunction/}}
#+LATEX_HEADER:\setcounter{secnumdepth}{5}
#+LATEX_HEADER:\lfoot{\footnotesize\today\ at \thistime}


#+BIBLIOGRAPHY: MyBib alphanat
#+LaTeX_CLASS: UoM-draft-org-article

## Write text after begin { document } 

\setcounter{chapter}{1}
\chapter{Methods}\label{sec:Ch2:Methods}



This chapter introduces the methods used throughout this thesis which
were not the product of the author.  Any methods or procedures that are
performed within one chapter are described in that particular chapter.


## set global variables for in-code blocks 
* Prelude 							   :noexport:

#+begin_src emacs-lisp 
  (add-to-list 'org-export-latex-classes
               '("UoM-draft-org-article"
 "\\documentclass[11pt,a4paper,twoside,openright]{book}
  \\usepackage{../hg/manuscript/style/uomthesis}
  \\input{../hg/manuscript/user-defined}
  \\usepackage[acronym]{glossaries}
  \\input{../hg/manuscript/misc/glossary}
  \\makeglossaries
  \\pretolerance=150
  \\tolerance=100
  \\setlength{\\emergencystretch}{3em}
  \\overfullrule=1mm
 %%  \\usepackage[notcite]{showkeys}
  \\lfoot{\\footnotesize\\today\\ at \\thistime}
        [NO-DEFAULT-PACKAGES]
        [NO-PACKAGES]"
                 ("\\clearpage\\section{%s}" . "\n\\clearpage\\section{%s}")
                 ("\\subsection{%s}" . "\n\\clearpage\\subsection{%s}")
                 ("\\subsubsection{%s}" . "\n\\subsubsection{%s}")
                 ("\\paragraph{%s}" . "\n\\paragraph{%s}")
                 ("\\subparagraph{%s}" . "\n\\subparagraph{%s}")))
  (setq org-latex-to-pdf-process '("pdflatex -interaction nonstopmode %f" "makeglossaries %b" "bibtex %b"  "pdflatex -interaction nonstopmode %f"  "pdflatex -interaction nonstopmode %f" ))
  (setq org-export-latex-title-command "\\singlespacing{\\tableofcontents\\printglossaries}")
#+end_src

#+RESULTS:
: \singlespacing{\tableofcontents\printglossaries}


